Catalogs/ВидыСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ВидыСертификатов</Name>
			<Comment>Виды сертификатов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>OnLine</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаДисконтнаяКатрочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминалПогашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыСертификатов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура OnLineПриИзменении(Элемент)

	Объект.Локальная = Не Объект.OnLine;
	
	// Настройка формы.
	Элементы.НеобходимаДисконтнаяКатрочка.Доступность = Не Объект.OnLine;
	Элементы.НеобходимПароль.Доступность =  Не Объект.OnLine;
	
КонецПроцедуры // OnLineПриИзменении()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Настройка формы.
	//OnLineПриИзменении(Неопределено); //Костенюк Александр-Закомментировано 01.04.2015
	
КонецПроцедуры // ПриОткрытии()
